## 2.2. Pandas Series and DataFrames

### Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series(['Male', 'Female', 'Male', 'Male', 'Female', 'Female', 'Female'])

0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6    Female
dtype: object

In [3]:
pd.Series(np.array(['Male', 'Female', 'Male', 'Male', 'Female', 'Female', 'Female']))

0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6    Female
dtype: object

In [4]:
ser=pd.Series(np.array(['Male', 'Female', 'Male', 'Male', 'Female', 'Female', 'Female']))

In [5]:
type(ser)

pandas.core.series.Series

In [6]:
dict_data={'a':1, 'b':2, 'c':3}

In [7]:
pd.Series(dict_data)

a    1
b    2
c    3
dtype: int64

In [8]:
ser1=pd.Series(dict_data)

In [9]:
type(ser1)

pandas.core.series.Series

In [10]:
ser1.index

Index(['a', 'b', 'c'], dtype='object')

In [11]:
ser1.values

array([1, 2, 3])

In [12]:
list_data=['2019-01-02', 3.14, 'ABC', 100, True]

In [13]:
ser2=pd.Series(list_data)

In [14]:
ser2

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [15]:
ser2.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
pd.DataFrame({"Name": ["Braund, Mr, Owen Harries",
                       "Allen, Mr. William Henry",
                       "Bonnel, Miss. Elizabeth"],
              "Age": [22, 35, 58],
              "Sex": ["male", "make", "female"]})

                       Name  Age     Sex
0  Braund, Mr, Owen Harries   22    male
1  Allen, Mr. William Henry   35    make
2   Bonnel, Miss. Elizabeth   58  female

In [17]:
df=pd.DataFrame({"Name": ["Braund, Mr, Owen Harries",
                       "Allen, Mr. William Henry",
                       "Bonnel, Miss. Elizabeth"],
              "Age": [22, 35, 58],
              "Sex": ["male", "make", "female"]})

In [18]:
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [19]:
type(df['Age'])

pandas.core.series.Series

In [20]:
df['Age'][0]

22

In [21]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,0]])

In [22]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [23]:
df[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [24]:
type(df[0])

pandas.core.series.Series

In [25]:
eye=pd.Series({'Brown':220, 'Blue':215, 'Hazel':93, 'Green':64})

In [26]:
eye.index

Index(['Brown', 'Blue', 'Hazel', 'Green'], dtype='object')

In [27]:
type(eye)

pandas.core.series.Series

In [28]:
eye.name

In [29]:
eye.name="eye_color"

In [30]:
eye

Brown    220
Blue     215
Hazel     93
Green     64
Name: eye_color, dtype: int64

In [31]:
eye.name

'eye_color'

In [32]:
eye.index

Index(['Brown', 'Blue', 'Hazel', 'Green'], dtype='object')

In [33]:
eye.values

array([220, 215,  93,  64])

In [34]:
eye.sort_values()

Green     64
Hazel     93
Blue     215
Brown    220
Name: eye_color, dtype: int64

In [35]:
eye.sort_index()

Blue     215
Brown    220
Green     64
Hazel     93
Name: eye_color, dtype: int64

In [36]:
eye.unique()

array([220, 215,  93,  64])

In [37]:
eye.nunique()

4

In [38]:
my_data2=[220, 215, 93, 64, 64]

In [39]:
eye2=pd.Series(data=my_data2, index=['Brown', 'Blue', 'Blue', 'Hazel', 'Green'])

In [40]:
eye2

Brown    220
Blue     215
Blue      93
Hazel     64
Green     64
dtype: int64

In [41]:
eye2.unique()

array([220, 215,  93,  64])

In [42]:
eye2.nunique()

4

In [43]:
eye2.value_counts()

64     2
220    1
215    1
93     1
Name: count, dtype: int64

In [44]:
ser=pd.Series([0,10,20,30,40], index=['a','b','c','d','e'])

In [45]:
ser[1]

10

In [46]:
ser['b']

10

In [47]:
ser[1:3]

b    10
c    20
dtype: int64

In [48]:
ser1=pd.Series([0,1,2,3,4], index=[0,1,2,3,4])
ser2=pd.Series([0,1,2,3,4], index=[4,3,2,1,0])

In [49]:
ser1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [50]:
ser2

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [51]:
ser1+ser2

0    4
1    4
2    4
3    4
4    4
dtype: int64

In [52]:
ser1*ser2

0    0
1    3
2    4
3    3
4    0
dtype: int64

In [53]:
ser1/ser2

0    0.000000
1    0.333333
2    1.000000
3    3.000000
4         inf
dtype: float64

In [54]:
ser1.sum()

10

In [55]:
ser1.mean()

2.0

In [56]:
ser1.median()

2.0

In [57]:
ser1.min()

0

In [58]:
ser1.std()

1.5811388300841898

In [59]:
ser1.sort_values()

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [60]:
ser_height=pd.Series([160,170,180],name='height')

In [61]:
plus_10=lambda x:x+10

In [62]:
plus_10(5)

15

In [63]:
ser_height.apply(lambda x:x+10)

0    170
1    180
2    190
Name: height, dtype: int64

### Pandas Series and DataFrame Practice

In [64]:
pd.read_csv('data_iris.csv')

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [65]:
iris_df=pd.read_csv('data_iris.csv')

In [66]:
type(iris_df)

pandas.core.frame.DataFrame

In [67]:
data={'NAME':['Jake','Jeniffer','Paul','Andrew'], 'AGE':[24,21,25,19], 'GENDER':['M','F','M','M']}

In [68]:
pd.DataFrame(data)

       NAME  AGE GENDER
0      Jake   24      M
1  Jeniffer   21      F
2      Paul   25      M
3    Andrew   19      M

In [69]:
df=pd.DataFrame(data)

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    4 non-null      object
 1   AGE     4 non-null      int64
 2   GENDER  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [71]:
iris_df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [72]:
iris_df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [73]:
iris_df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [74]:
iris_df.index

RangeIndex(start=0, stop=150, step=1)

In [75]:
iris_df.columns=['Sepal_Length', 'Sepal_Width', 'Petal_Length', 'Petal_Width', 'Species']

In [76]:
iris_df

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [77]:
iris_df.Sepal_Length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [78]:
iris_df['Sepal_Length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [79]:
iris_df[['Sepal_Length', 'Sepal_Width']]

     Sepal_Length  Sepal_Width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [80]:
df=pd.DataFrame([['Name','Age','Sex','School'],['Tom',15,'Male','middle'],['Alice',10,'FeMale','elementary']])

In [81]:
df

       0    1       2           3
0   Name  Age     Sex      School
1    Tom   15    Male      middle
2  Alice   10  FeMale  elementary

In [82]:
df=pd.DataFrame([['Tom',15,'Male','middle'],['Alice',10,'FeMale','elementary']], columns=['Name','Age','Sex','School'])

In [83]:
df

    Name  Age     Sex      School
0    Tom   15    Male      middle
1  Alice   10  FeMale  elementary

In [84]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [85]:
df.index=['stu1','stu2']

In [86]:
df

       Name  Age     Sex      School
stu1    Tom   15    Male      middle
stu2  Alice   10  FeMale  elementary

In [87]:
df.index

Index(['stu1', 'stu2'], dtype='object')

In [88]:
df.columns=['student_name', 'years', 'sex2', 'school2']

In [89]:
df

     student_name  years    sex2     school2
stu1          Tom     15    Male      middle
stu2        Alice     10  FeMale  elementary

In [90]:
df.rename(index={'stu1':'student1'})

         student_name  years    sex2     school2
student1          Tom     15    Male      middle
stu2            Alice     10  FeMale  elementary

In [91]:
df

     student_name  years    sex2     school2
stu1          Tom     15    Male      middle
stu2        Alice     10  FeMale  elementary

In [92]:
df.rename(index={'stu1':'student1'}, inplace=True)

In [93]:
df

         student_name  years    sex2     school2
student1          Tom     15    Male      middle
stu2            Alice     10  FeMale  elementary

In [94]:
df=df.rename(index={'stu2':'student2'})

In [95]:
df

         student_name  years    sex2     school2
student1          Tom     15    Male      middle
student2        Alice     10  FeMale  elementary

In [96]:
df.rename(columns={'student_name':'stu_name'}, inplace=True)

In [97]:
df

         stu_name  years    sex2     school2
student1      Tom     15    Male      middle
student2    Alice     10  FeMale  elementary

In [98]:
exam_data = {'math':[90,80,70], 'eng':[98,89,95],
             'music':[85,95,100], 'science':[100,90,90]}

In [99]:
exam_data

{'math': [90, 80, 70],
 'eng': [98, 89, 95],
 'music': [85, 95, 100],
 'science': [100, 90, 90]}

In [100]:
df = pd.DataFrame(exam_data, index=['stu1', 'stu2', 'stu3'])

In [101]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [102]:
df2=df[:]

In [103]:
df2.drop('stu2', inplace=True)

/var/folders/zt/d4hf1bc92d5527jl1y_x0drc0000gn/T/ipykernel_65811/3113900722.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('stu2', inplace=True)

In [104]:
df2

      math  eng  music  science
stu1    90   98     85      100
stu3    70   95    100       90

In [105]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [106]:
df3=df[:]

In [107]:
df3.drop(['stu2','stu3'], axis=0, inplace=True)

/var/folders/zt/d4hf1bc92d5527jl1y_x0drc0000gn/T/ipykernel_65811/1926387925.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop(['stu2','stu3'], axis=0, inplace=True)

In [108]:
df3

      math  eng  music  science
stu1    90   98     85      100

In [109]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [110]:
df4=df[:]

In [111]:
df4.drop('math', axis=1, inplace=True)

/var/folders/zt/d4hf1bc92d5527jl1y_x0drc0000gn/T/ipykernel_65811/2869093251.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop('math', axis=1, inplace=True)

In [112]:
df4

      eng  music  science
stu1   98     85      100
stu2   89     95       90
stu3   95    100       90

In [113]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [114]:
df5=df[:]

In [115]:
df5.drop(['eng', 'science'], axis=1, inplace=True)

/var/folders/zt/d4hf1bc92d5527jl1y_x0drc0000gn/T/ipykernel_65811/3400750949.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5.drop(['eng', 'science'], axis=1, inplace=True)

In [116]:
df5

      math  music
stu1    90     85
stu2    80     95
stu3    70    100

In [117]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [118]:
label1 = df.loc['stu1']
position1=df.iloc[0]

In [119]:
label1

math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64

In [120]:
position1

math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64

In [121]:
label2 = df.loc[['stu1', 'stu2']]
position2=df.iloc[[0, 1]]

In [122]:
label2

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90

In [123]:
position2

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90

In [124]:
math1=df['math']

In [125]:
math1

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64

In [126]:
english=df.eng

In [127]:
english

stu1    98
stu2    89
stu3    95
Name: eng, dtype: int64

In [128]:
music_sci=df[['music', 'science']]

In [129]:
music_sci

      music  science
stu1     85      100
stu2     95       90
stu3    100       90

In [130]:
df['math']

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64

In [131]:
df[['math']]

      math
stu1    90
stu2    80
stu3    70

In [132]:
exam_data={'name':['hongildong', 'hongeeedong', 'hongsamdong'],
           'math':[90, 80, 70],
           'eng':[98, 89, 95],
           'music':[85, 95, 100],
           'phys_tra':[100, 90, 90]}

In [133]:
df = pd.DataFrame(exam_data)

In [134]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [135]:
df.set_index('name', inplace=True)

In [136]:
df.index

Index(['hongildong', 'hongeeedong', 'hongsamdong'], dtype='object', name='name')

In [137]:
df

             math  eng  music  phys_tra
name
hongildong     90   98     85       100
hongeeedong    80   89     95        90
hongsamdong    70   95    100        90

In [138]:
a=df.loc['hongildong', 'music']

In [139]:
a

85

In [140]:
c=df.loc['hongildong', ['music', 'phys_tra']]

In [141]:
c

music        85
phys_tra    100
Name: hongildong, dtype: int64

In [142]:
d=df.iloc[0, [2, 3]]

In [143]:
d

music        85
phys_tra    100
Name: hongildong, dtype: int64

In [144]:
e=df.loc['hongildong', 'music':'phys_tra']

In [145]:
e

music        85
phys_tra    100
Name: hongildong, dtype: int64

In [146]:
f=df.iloc[0, 2:]

In [147]:
f

music        85
phys_tra    100
Name: hongildong, dtype: int64

In [148]:
g=df.loc[['hongildong', 'hongeeedong'], ['music', 'phys_tra']]

In [149]:
g

             music  phys_tra
name
hongildong      85       100
hongeeedong     95        90

In [150]:
h=df.iloc[[0, 1], [2, 3]]

In [151]:
h

             music  phys_tra
name
hongildong      85       100
hongeeedong     95        90

In [152]:
i=df.loc['hongildong':'hongeeedong', 'music':'phys_tra']

In [153]:
i

             music  phys_tra
name
hongildong      85       100
hongeeedong     95        90

In [154]:
df

             math  eng  music  phys_tra
name
hongildong     90   98     85       100
hongeeedong    80   89     95        90
hongsamdong    70   95    100        90

In [155]:
df['kor'] = 80

In [156]:
df

             math  eng  music  phys_tra  kor
name
hongildong     90   98     85       100   80
hongeeedong    80   89     95        90   80
hongsamdong    70   95    100        90   80

In [157]:
df

             math  eng  music  phys_tra  kor
name
hongildong     90   98     85       100   80
hongeeedong    80   89     95        90   80
hongsamdong    70   95    100        90   80

In [158]:
df.loc[3]=0

In [159]:
df

             math  eng  music  phys_tra  kor
name
hongildong     90   98     85       100   80
hongeeedong    80   89     95        90   80
hongsamdong    70   95    100        90   80
3               0    0      0         0    0

In [160]:
df.loc[3]=[90, 80, 70, 60, 77]

In [161]:
df

             math  eng  music  phys_tra  kor
name
hongildong     90   98     85       100   80
hongeeedong    80   89     95        90   80
hongsamdong    70   95    100        90   80
3              90   80     70        60   77

In [162]:
df.index

Index(['hongildong', 'hongeeedong', 'hongsamdong', 3], dtype='object', name='name')

In [163]:
df.index[3]

3

In [164]:
df

             math  eng  music  phys_tra  kor
name
hongildong     90   98     85       100   80
hongeeedong    80   89     95        90   80
hongsamdong    70   95    100        90   80
3              90   80     70        60   77

In [165]:
df=df.reset_index()

In [166]:
df

          name  math  eng  music  phys_tra  kor
0   hongildong    90   98     85       100   80
1  hongeeedong    80   89     95        90   80
2  hongsamdong    70   95    100        90   80
3            3    90   80     70        60   77

In [167]:
df.iloc[3,0]='hongsadong'

In [168]:
df

          name  math  eng  music  phys_tra  kor
0   hongildong    90   98     85       100   80
1  hongeeedong    80   89     95        90   80
2  hongsamdong    70   95    100        90   80
3   hongsadong    90   80     70        60   77

In [169]:
df.set_index('name', inplace=True)

In [170]:
df

             math  eng  music  phys_tra  kor
name
hongildong     90   98     85       100   80
hongeeedong    80   89     95        90   80
hongsamdong    70   95    100        90   80
hongsadong     90   80     70        60   77

In [171]:
exam_data={'name':['stu1', 'stu2', 'stu2'],
           'math':[90, 80, 70],
           'eng':[98, 89, 95],
           'mus':[85, 95, 100],
           'phy':[100, 90, 90]}
df = pd.DataFrame(exam_data)

In [172]:
df

   name  math  eng  mus  phy
0  stu1    90   98   85  100
1  stu2    80   89   95   90
2  stu2    70   95  100   90

In [173]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [174]:
df.set_index('name', inplace=True)

In [175]:
df

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu2    70   95  100   90

In [176]:
df.iloc[0][3] = 80

In [177]:
df

      math  eng  mus  phy
name
stu1    90   98   85   80
stu2    80   89   95   90
stu2    70   95  100   90

In [178]:
df.loc['stu1']['phy'] = 90

In [179]:
df

      math  eng  mus  phy
name
stu1    90   98   85   90
stu2    80   89   95   90
stu2    70   95  100   90

In [180]:
df.loc['stu1']['phy'] = 100

In [181]:
df

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu2    70   95  100   90

In [182]:
df.loc['stu1'][['mus', 'phy']] = 50

In [183]:
df

      math  eng  mus  phy
name
stu1    90   98   50   50
stu2    80   89   95   90
stu2    70   95  100   90

In [184]:
df.loc['stu1'][['mus', 'phy']] = 100, 100

In [185]:
df

      math  eng  mus  phy
name
stu1    90   98  100  100
stu2    80   89   95   90
stu2    70   95  100   90

In [186]:
df.reset_index(inplace=True)

In [187]:
df

   name  math  eng  mus  phy
0  stu1    90   98  100  100
1  stu2    80   89   95   90
2  stu2    70   95  100   90

In [188]:
dff=df.transpose()

In [189]:
dff

         0     1     2
name  stu1  stu2  stu2
math    90    80    70
eng     98    89    95
mus    100    95   100
phy    100    90    90

In [190]:
dfff = dff.T

In [191]:
dfff

   name math eng  mus  phy
0  stu1   90  98  100  100
1  stu2   80  89   95   90
2  stu2   70  95  100   90

In [192]:
exam_data={'name':['stu1', 'stu2', 'stu2'],
           'math':[90, 80, 70],
           'eng':[98, 89, 95],
           'mus':[85, 95, 100],
           'phy':[100, 90, 90]}
df = pd.DataFrame(exam_data)

In [193]:
ndf=df.set_index(['name'])

In [194]:
ndf

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu2    70   95  100   90

In [195]:
ndf2=ndf.set_index(['mus'])

In [196]:
ndf2

     math  eng  phy
mus
85     90   98  100
95     80   89   90
100    70   95   90

In [197]:
ndf3=ndf.set_index(['math', 'mus'])

In [198]:
ndf3

          eng  phy
math mus
90   85    98  100
80   95    89   90
70   100   95   90

In [199]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])

In [200]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [201]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [202]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [203]:
ndf = df.reset_index()

In [204]:
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [205]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [206]:
ndf = df.sort_index(ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [207]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [208]:
ndf = df.sort_values(by='c1', ascending=False)
print(ndf)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

### Series Operations

In [209]:
student1 = pd.Series({'kor':100, 'eng':80, 'math':90})
student1

kor     100
eng      80
math     90
dtype: int64

In [210]:
percentage = student1/200
percentage

kor     0.50
eng     0.40
math    0.45
dtype: float64

In [211]:
student1 = pd.Series({'kor':100, 'eng':80, 'math':90})
student2 = pd.Series({'math':80, 'kor':90, 'eng':80})

addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2

In [212]:
result = pd.DataFrame([addition, subtraction, multiplication, division],
                      index=['addition', 'subtraction', 'multiplication', 'division']) 
result

                   eng          kor      math
addition         160.0   190.000000   170.000
subtraction        0.0    10.000000    10.000
multiplication  6400.0  9000.000000  7200.000
division           1.0     1.111111     1.125

In [213]:
student1 = pd.Series({'kor':np.nan, 'eng':80, 'math':90})
student2 = pd.Series({'math':80, 'kor':90})

addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2

In [214]:
result = pd.DataFrame([addition, subtraction, multiplication, division],
                      index=['addition', 'subtraction', 'multiplication', 'division']) 
result

                eng  kor      math
addition        NaN  NaN   170.000
subtraction     NaN  NaN    10.000
multiplication  NaN  NaN  7200.000
division        NaN  NaN     1.125

In [215]:
student1 = pd.Series({'kor':np.nan, 'eng':80, 'math':90})
student2 = pd.Series({'math':80, 'kor':90})

sr_add = student1.add(student2, fill_value=0)
sr_sub = student1.sub(student2, fill_value=0)
sr_mul = student1.mul(student2, fill_value=0)
sr_div = student1.div(student2, fill_value=0)

In [216]:
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
                      index=['addition', 'subtraction', 'multiplication', 'division']) 
result

                 eng   kor      math
addition        80.0  90.0   170.000
subtraction     80.0 -90.0    10.000
multiplication   0.0   0.0  7200.000
division         inf   0.0     1.125

### DataFrame Operations

In [217]:
import seaborn as sns

titanic = sns.load_dataset('titanic')

In [218]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [219]:
addition = df + 10
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [220]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]

In [221]:
addition = df + 10
addition

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [222]:
subtraction = addition - df
subtraction.tail()

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

## 2.3. Merging and Binding DataFrames

In [223]:
# pd.merge(df_left, df_right, on='NAME')
# pd.merge(df_left, df_right, left_on='NAME', right_on='NAME', how='inner')
# pd.merge(df_left, df_right, left_on='NAME', right_on='NAME', how='left')
# pd.merge(df_left, df_right, left_on='NAME', right_on='NAME', how='right')
# pd.merge(df_left, df_right, left_on='NAME', right_on='NAME', how='outer')

In [224]:
# pd.concat([df_A, df_B], sort=True)
# pd.concat([df_A, df_B], axis=1, sort=True)

In [225]:
df1 = pd.DataFrame({'a':['a0', 'a1', 'a2', 'a3'],
                    'b':['b0', 'b1', 'b2', 'b3'],
                    'c':['c0', 'c1', 'c2', 'c3']},
                  index=[0, 1, 2, 3])

In [226]:
df1

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

In [227]:
df2 = pd.DataFrame({'a':['a2', 'a3', 'a4', 'a5'],
                    'b':['b2', 'b3', 'b4', 'b5'],
                    'c':['c2', 'c3', 'c4', 'c5'],
                    'd':['d2', 'd3', 'd4', 'd5']},
                  index=[2, 3, 4, 5])

In [228]:
df2

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [229]:
pd.concat([df1, df2])

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

In [230]:
pd.concat([df1, df2], ignore_index=True)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [231]:
pd.concat([df1, df2], axis=1)

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [232]:
df1 = pd.read_excel('./stock price.xlsx')
df2 = pd.read_excel('./stock valuation.xlsx')

In [233]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          10 non-null     int64
 1   stock_name  10 non-null     object
 2   value       10 non-null     float64
 3   price       10 non-null     int64
dtypes: float64(1), int64(2), object(1)
memory usage: 448.0+ bytes

In [234]:
df1.head()

       id                               stock_name          value   price
0  128940                     Hanmi Pharmaceutical   59385.666667  421000
1  130960                                   CJ E&M   58540.666667   98900
2  138250                              NS Shopping   14558.666667   13200
3  139480                                   E-mart  239230.833333  254500
4  142280  Green Cross Medical Science Corporation     468.833333   10200

In [235]:
df2.head()

       id                    name           eps     bps        per       pbr
0  130960                  CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480               Harim Co.    274.166667    3551  11.489362  0.887074
2  138040  Meritz Financial Group   2122.333333   14894   6.313806  0.899691
3  139480                  E-mart  18268.166667  295780  13.931338  0.860437
4  145990                 Samyang   5741.000000  108090  14.283226  0.758627

In [236]:
pd.merge(df1, df2)

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
1,139480,E-mart,239230.833333,254500,E-mart,18268.166667,295780,13.931338,0.860437
2,145990,Samyang,82750.000000,82000,Samyang,5741.000000,108090,14.283226,0.758627
3,185750,Chong Kun Dang,40293.666667,100500,Chong Kun Dang,3990.333333,40684,25.185866,2.470259
4,204210,Mode Tour Reit,3093.333333,3475,Mode Tour Reit,85.166667,5335,40.802348,0.651359

In [237]:
df_1 = pd.read_excel('./stock price.xlsx')
df_2 = pd.read_excel('./stock valuation.xlsx')

In [238]:
pd.merge(df_1, df_2)

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
1,139480,E-mart,239230.833333,254500,E-mart,18268.166667,295780,13.931338,0.860437
2,145990,Samyang,82750.000000,82000,Samyang,5741.000000,108090,14.283226,0.758627
3,185750,Chong Kun Dang,40293.666667,100500,Chong Kun Dang,3990.333333,40684,25.185866,2.470259
4,204210,Mode Tour Reit,3093.333333,3475,Mode Tour Reit,85.166667,5335,40.802348,0.651359

In [239]:
df_1 = pd.read_excel('./stock price.xlsx')
df_2 = pd.read_excel('./stock valuation.xlsx')

In [240]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left: 'DataFrame | Series', right: 'DataFrame | Series', how: 'MergeHow' = 'inner', on: 'IndexLabel | None' = None, left_on: 'IndexLabel | None' = None, right_on: 'IndexLabel | None' = None, left_index: 'bool' = False, right_index: 'bool' = False, sort: 'bool' = False, suffixes: 'Suffixes' = ('_x', '_y'), copy: 'bool | None' = None, indicator: 'str | bool' = False, validate: 'str | None' = None) -> 'DataFrame'
    Merge DataFrame or named Series objects with a database-style join.

    A named Series object is treated as a DataFrame with a single named column.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.
    When performing a cross merge, no column specifications to merge on are
    allowed.

    .. warning::

        If both key columns contain rows where the key is a null value, those
        rows will be matched against each other. This is different from usual SQL
        join behaviour and can lead to unexpected results.

    Parameters
    ----------
    left : DataFrame or named Series
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
        * cross: creates the cartesian product from both frames, preserves the order
          of the left keys.

          .. versionadded:: 1.2.0

    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : list-like, default is ("_x", "_y")
        A length-2 sequence where each element is optionally a string
        indicating the suffix to add to overlapping column names in
        `left` and `right` respectively. Pass a value of `None` instead
        of a string to indicate that the column name from `left` or
        `right` should be left as-is, with no suffix. At least one of the
        values must not be None.
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to the output DataFrame called "_merge" with
        information on the source of each row. The column can be given a different
        name by providing a string argument. The column will have a Categorical
        type with the value of "left_only" for observations whose merge key only
        appears in the left DataFrame, "right_only" for observations
        whose merge key only appears in the right DataFrame, and "both"
        if the observation's merge key is found in both DataFrames.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------
    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

    >>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
    >>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
    >>> df1
          a  b
    0   foo  1
    1   bar  2
    >>> df2
          a  c
    0   foo  3
    1   baz  4

    >>> df1.merge(df2, how='inner', on='a')
          a  b  c
    0   foo  1  3

    >>> df1.merge(df2, how='left', on='a')
          a  b  c
    0   foo  1  3.0
    1   bar  2  NaN

    >>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
    >>> df2 = pd.DataFrame({'right': [7, 8]})
    >>> df1
        left
    0   foo
    1   bar
    >>> df2
        right
    0   7
    1   8

    >>> df1.merge(df2, how='cross')
       left  right
    0   foo      7
    1   foo      8
    2   bar      7
    3   bar      8

In [241]:
pd.merge(df1, df2)

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
1,139480,E-mart,239230.833333,254500,E-mart,18268.166667,295780,13.931338,0.860437
2,145990,Samyang,82750.000000,82000,Samyang,5741.000000,108090,14.283226,0.758627
3,185750,Chong Kun Dang,40293.666667,100500,Chong Kun Dang,3990.333333,40684,25.185866,2.470259
4,204210,Mode Tour Reit,3093.333333,3475,Mode Tour Reit,85.166667,5335,40.802348,0.651359

In [242]:
df1_3 = pd.read_excel('./stock price.xlsx')
df2_3 = pd.read_excel('./stock valuation.xlsx')

In [243]:
pd.merge(df1_3, df2_3)

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
1,139480,E-mart,239230.833333,254500,E-mart,18268.166667,295780,13.931338,0.860437
2,145990,Samyang,82750.000000,82000,Samyang,5741.000000,108090,14.283226,0.758627
3,185750,Chong Kun Dang,40293.666667,100500,Chong Kun Dang,3990.333333,40684,25.185866,2.470259
4,204210,Mode Tour Reit,3093.333333,3475,Mode Tour Reit,85.166667,5335,40.802348,0.651359

In [244]:
df1 = pd.read_excel('./stock price.xlsx')
df2 = pd.read_excel('./stock valuation.xlsx')

In [245]:
pd.merge(df1, df2, on='id', how='left')

,id,stock_name,value,price,name,eps,bps,per,pbr
0,128940,Hanmi Pharmaceutical,59385.666667,421000,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,NS Shopping,14558.666667,13200,NaN,NaN,NaN,NaN,NaN
3,139480,E-mart,239230.833333,254500,E-mart,18268.166667,295780.0,13.931338,0.860437
4,142280,Green Cross Medical Science Corporation,468.833333,10200,NaN,NaN,NaN,NaN,NaN
5,145990,Samyang,82750.000000,82000,Samyang,5741.000000,108090.0,14.283226,0.758627
6,185750,Chong Kun Dang,40293.666667,100500,Chong Kun Dang,3990.333333,40684.0,25.185866,2.470259
7,192400,Cuckoo Holdings,179204.666667,177500,NaN,NaN,NaN,NaN,NaN
8,199800,Toolgen,-2514.333333,115400,NaN,NaN,NaN,NaN,NaN
9,204210,Mode Tour Reit,3093.333333,3475,Mode Tour Reit,85.166667,5335.0,40.802348,0.651359

In [246]:
pd.merge(df1, df2, on='id', how='right')

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900.0,CJ E&M,6301.333333,54068,15.695091,1.829178
1,136480,NaN,NaN,NaN,Harim Co.,274.166667,3551,11.489362,0.887074
2,138040,NaN,NaN,NaN,Meritz Financial Group,2122.333333,14894,6.313806,0.899691
3,139480,E-mart,239230.833333,254500.0,E-mart,18268.166667,295780,13.931338,0.860437
4,145990,Samyang,82750.000000,82000.0,Samyang,5741.000000,108090,14.283226,0.758627
5,161390,NaN,NaN,NaN,Hankook Tire,5648.500000,51341,7.453306,0.820007
6,181710,NaN,NaN,NaN,NHN Entertainment,2110.166667,78434,30.755864,0.827447
7,185750,Chong Kun Dang,40293.666667,100500.0,Chong Kun Dang,3990.333333,40684,25.185866,2.470259
8,204210,Mode Tour Reit,3093.333333,3475.0,Mode Tour Reit,85.166667,5335,40.802348,0.651359
9,207940,NaN,NaN,NaN,Samsung BioLogics,4644.166667,60099,89.790059,6.938551

In [247]:
pd.merge(df1, df2, on='id', how='outer')

,id,stock_name,value,price,name,eps,bps,per,pbr
0,128940,Hanmi Pharmaceutical,59385.666667,421000.0,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900.0,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,NS Shopping,14558.666667,13200.0,NaN,NaN,NaN,NaN,NaN
3,139480,E-mart,239230.833333,254500.0,E-mart,18268.166667,295780.0,13.931338,0.860437
4,142280,Green Cross Medical Science Corporation,468.833333,10200.0,NaN,NaN,NaN,NaN,NaN
5,145990,Samyang,82750.000000,82000.0,Samyang,5741.000000,108090.0,14.283226,0.758627
6,185750,Chong Kun Dang,40293.666667,100500.0,Chong Kun Dang,3990.333333,40684.0,25.185866,2.470259
7,192400,Cuckoo Holdings,179204.666667,177500.0,NaN,NaN,NaN,NaN,NaN
8,199800,Toolgen,-2514.333333,115400.0,NaN,NaN,NaN,NaN,NaN
9,204210,Mode Tour Reit,3093.333333,3475.0,Mode Tour Reit,85.166667,5335.0,40.802348,0.651359
10,136480,NaN,NaN,NaN,Harim Co.,274.166667,3551.0,11.489362,0.887074
11,138040,NaN,NaN,NaN,Meritz Financial Group,2122.333333,14894.0,6.313806,0.899691
12,161390,NaN,NaN,NaN,Hankook Tire,5648.500000,51341.0,7.453306,0.820007
13,181710,NaN,NaN,NaN,NHN Entertainment,2110.166667,78434.0,30.755864,0.827447
14,207940,NaN,NaN,NaN,Samsung BioLogics,4644.166667,60099.0,89.790059,6.938551

## 2.4. DataFrame Sorting and Multi-Index

In [248]:
# df.sort_values(by='bloodtype')
# df.sort_values(by='bloodtype', ascending=False)
# df.sort_values(by=['bloodtype', 'gender'])

In [249]:
my_header = ['a', 'b', 'c']
my_index_out = ['G1']*3 + ['G2']*3
my_index_in=[1,2,3]*2
my_index_zipped=list(zip(my_index_out, my_index_in))
my_index = pd.MultiIndex.from_tuples(my_index_zipped)
df = pd.DataFrame(data=np.random.randn(6,3), index=my_index, columns=my_header)
df

             a         b         c
G1 1  0.402468  2.678839 -0.969379
   2 -1.080610  1.589928  0.328897
   3  0.355438  0.964273  0.936052
G2 1 -0.192394 -0.418107  1.610395
   2  2.011048 -0.842061 -0.048251
   3 -0.297995  1.211800  1.420018

## 2.5. Examining the Characteristics of Data Through Descriptive Statistics and Data Samples

In [250]:
df=pd.read_csv('data_studentlist.csv')

In [251]:
df.head(3)

             name gender  age  grade absence bloodtype  height  weight
0   Jared Diamond      M   23      3       Y         O   165.3    68.2
1  Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2    Brian Martin      M   24      4       N         B   175.0    80.1

In [252]:
df.groupby(['gender', 'bloodtype'])['height'].mean()

gender  bloodtype
F       A            172.450000
        AB           170.100000
        B            158.200000
        O            164.433333
M       A            165.700000
        AB           181.050000
        B            174.550000
        O            166.200000
Name: height, dtype: float64

In [253]:
my_dict = {"Size":["L", "L", "M", "M", "M", "S", "S", "S", "S"],
           "Type":["A", "A", "A", "B", "B", "A", "A", "B", "B"],
           "Location":["L1", "L1", "L1", "L2", "L2", "L1", "L2", "L2", "L1"],
           "A":[1, 2, 2, 3, 3, 4, 5, 6, 7],
           "B":[2, 4, 5, 5, 6, 6, 8, 9, 9]}
df = pd.DataFrame(my_dict)
df

  Size Type Location  A  B
0    L    A       L1  1  2
1    L    A       L1  2  4
2    M    A       L1  2  5
3    M    B       L2  3  5
4    M    B       L2  3  6
5    S    A       L1  4  6
6    S    A       L2  5  8
7    S    B       L2  6  9
8    S    B       L1  7  9

In [254]:
dfr = pd.pivot_table(df, index=['Size', 'Type'], columns='Location', values='B')
dfr

Location    L1   L2
Size Type
L    A     3.0  NaN
M    A     5.0  NaN
     B     NaN  5.5
S    A     6.0  8.0
     B     9.0  9.0

In [255]:
dfr.columns

Index(['L1', 'L2'], dtype='object', name='Location')

In [256]:
dfr.index

MultiIndex([('L', 'A'),
            ('M', 'A'),
            ('M', 'B'),
            ('S', 'A'),
            ('S', 'B')],
           names=['Size', 'Type'])

In [257]:
pd.pivot_table(df, index=['Size', 'Type'], columns='Location', values='B', fill_value=0)

Location   L1   L2
Size Type
L    A      3  0.0
M    A      5  0.0
     B      0  5.5
S    A      6  8.0
     B      9  9.0

In [258]:
pd.pivot_table(df, index=['Size', 'Type'], columns='Location', values='B', aggfunc=np.mean, fill_value=0)

Location   L1   L2
Size Type
L    A      3  0.0
M    A      5  0.0
     B      0  5.5
S    A      6  8.0
     B      9  9.0

In [259]:
dfr = pd.pivot_table(df, index='Location', columns=['Size', 'Type'], values='B')
dfr

Size        L    M         S
Type        A    A    B    A    B
Location
L1        3.0  5.0  NaN  6.0  9.0
L2        NaN  NaN  5.5  8.0  9.0

In [260]:
dfr.index

Index(['L1', 'L2'], dtype='object', name='Location')

In [261]:
dfr.columns

MultiIndex([('L', 'A'),
            ('M', 'A'),
            ('M', 'B'),
            ('S', 'A'),
            ('S', 'B')],
           names=['Size', 'Type'])

In [262]:
pd.pivot_table(df, index=['Size', 'Type'], columns='Location', values='B', aggfunc=np.median, fill_value=0)

Location   L1   L2
Size Type
L    A      3  0.0
M    A      5  0.0
     B      0  5.5
S    A      6  8.0
     B      9  9.0

In [263]:
pd.pivot_table(df, index=['Size', 'Type'], values=['A', 'B'], aggfunc=np.mean)

             A    B
Size Type
L    A     1.5  3.0
M    A     2.0  5.0
     B     3.0  5.5
S    A     4.5  7.0
     B     6.5  9.0

In [264]:
df.groupby(['Size', 'Type'])[['A', 'B']].mean()

             A    B
Size Type
L    A     1.5  3.0
M    A     2.0  5.0
     B     3.0  5.5
S    A     4.5  7.0
     B     6.5  9.0

In [265]:
pd.pivot_table(df, index=['Size', 'Type'], values=['A', 'B'], aggfunc={'A':np.max, 'B':np.min})

           A  B
Size Type
L    A     2  2
M    A     2  5
     B     3  5
S    A     5  6
     B     7  9

In [266]:
# df.sum(axis=0)
# df.sum(axis=1)
# df.mean(axis=0, skipna=False)
# df.describe()
# df.count(axis=0)
# df.A.corr(df.B)
# df.corr()
# df.corrwith(df.A)

In [267]:
# df.isnull()
# (df.isnull()).sum(axis=0)
# (df.isnull()).mean(axis=0)
# df.dropna(axis=0)
# df.dropna(axis=1)
# df.dropna(axis=0, thresh=3)
# df.fillna(value=0)